app/controllers/entry_controller.rb

  def complete
    @user = User.new( params[:user] )

    if @user.save
---
INSERT INTO "users" ("salt", "mail_address", "created_at", "updated_at", "hashed_password", "level", "twitter_id", "login_id", "display_name") VALUES('21755461600.811846160790058', NULL, '2011-04-10 13:30:18', '2011-04-10 13:30:18', '104e991e8b88ba4967e8aeab444114596772e1ad', NULL, NULL, 'test', 'テスト')

  def login
    @user = User.new( params[:login] )

    return if @user.blank?

    if !@user.login_id.blank? and !@user.password.blank?
      # ユーザ認証
      user = @user.authenticate

      unless user.blank?
        # ユーザ情報をセッションに格納
        user_session_set( user )

        result = Item.update_all( [ "user_id = ?", session[:user_id] ] )
---
SELECT login_id, display_name FROM "users" WHERE (id = 1) LIMIT 1
UPDATE "items" SET user_id = 1

  def show
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def edit
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update
    @user = User.find_by_id( session[:user_id] )

    if params[:user].blank?
      flash[:notice] = "ユーザ情報がありません。<br /><br />"
      redirect_to :action => "edit" and return
    end

    # パスワードチェックがtrueで無ければ
    unless @user.password_check?( params[:user][:password] )
      flash[:notice] = "「現在のパスワード」が正しくありません。<br /><br />"
      redirect_to :action => "edit" and return
    end

    if !params[:user][:edit_password].blank? and !params[:user][:edit_password_confirmation].blank?
      # 変更するパスワードと再入力パスワードが一致しなければ
      unless params[:user][:edit_password] == params[:user][:edit_password_confirmation]
        flash[:notice] = "「変更するパスワード」と「変更するパスワード(再入力)」が一致しません。<br /><br />"
        redirect_to :action => "edit" and return
      else
        # パスワード更新
        params[:user][:password] = params[:user][:edit_password]
      end
    end

    # ユーザ情報を更新
    if @user.update_attributes( params[:user] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-04-10 13:44:56', "salt" = '21760097400.83625223099464', "hashed_password" = '926cfb5c11fe57c0f52172f5bf5ff52b8ae72bf9' WHERE "id" = 1

  def edit_password
    @user = User.find_by_id( session[:user_id] )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def update_password
    @user = User.find_by_id( session[:user_id] )
    params_user = params[:user]

    if params_user.blank?
      flash[:notice] = "ユーザ情報がありません。<br /><br />"
      redirect_to :action => "edit_password", :id => @user.id and return
    end

    # パスワードチェックがtrueで無ければ
    unless @user.password_check?( params_user[:password] )
      flash[:notice] = "「現在のパスワード」が正しくありません。<br /><br />"
      redirect_to :action => "edit_password", :id => @user.id and return
    end

    # 変更するパスワードと再入力パスワードが一致しなければ
    unless params_user[:edit_password] == params_user[:password_confirmation]
      flash[:notice] = "「変更するパスワード」と「変更するパスワード(再入力)」が一致しません。<br /><br />"
      redirect_to :action => "edit_password", :id => @user.id and return
    end

    # パスワード更新
    params_user[:password] = params_user[:edit_password]

    # ユーザ情報を更新
    if @user.update_attributes( params_user )
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-04-10 13:47:25', "salt" = '21747470600.0785217134580365', "hashed_password" = '7c8586ee47225ef8ed6f17c28660172db8113b37' WHERE "id" = 1