app/controllers/items_controller.rb

  def show
    @now_date = date_set( :date => params[:date] )
    @sum_type = params[:sum_type] unless params[:sum_type].blank?

    @item = Item.find( params[:id] )
---
SELECT * FROM "items" WHERE ("items"."id" = 15)

  def edit
    @now_date = date_set( :date => params[:date] )
    @sum_type = params[:sum_type] unless params[:sum_type].blank?

    @item = Item.find( params[:id] )
---
SELECT * FROM "items" WHERE ("items"."id" = 15)

  def create
    @now_date = date_set( :date => params[:date] )
    @sum_type = params[:sum_type] unless params[:sum_type].blank?

    params[:item][:price] = params[:item][:price].gsub( ",", "" )  # カンマを削除
    params[:item][:price] = params[:item][:price].gsub( " ", "" )  # 半角空白を削除

    @item = Item.new( params[:item] )

    if @item.save
---
INSERT INTO "items" ("name", "price", "created_at", "updated_at", "cycle", "cycle_mode", "happen_at", "item_type") VALUES('テスト', 100, '2010-10-11 14:23:26', '2010-10-11 14:23:26', NULL, NULL, '2010-10-11', NULL)

  def update
    @now_date = date_set( :date => params[:date] )
    @sum_type = params[:sum_type] unless params[:sum_type].blank?

    @item = Item.find( params[:id] )

    params[:item][:price] = params[:item][:price].gsub( ",", "" )  # カンマを削除
    params[:item][:price] = params[:item][:price].gsub( " ", "" )  # 半角空白を削除

    if @item.update_attributes( params[:item] )
---
SELECT * FROM "items" WHERE ("items"."id" = 17)
UPDATE "items" SET "updated_at" = '2011-01-09 20:58:07', "price" = 991122 WHERE "id" = 17

  def destroy
    @now_date = date_set( :date => params[:date] )
    @sum_type = params[:sum_type] unless params[:sum_type].blank?

    @item = Item.find( params[:id] )
    @item.destroy
---
SELECT * FROM "items" WHERE ("items"."id" = 13)
DELETE FROM "items" WHERE "id" = 13