app/controllers/total_controller.rb

SELECT * FROM "items" WHERE (happen_at >= '2011-04-01' AND happen_at <= '2011-04-30') ORDER BY happen_at ASC, id ASC LIMIT 15 OFFSET 0
SELECT sum("items".price) AS sum_price FROM "items" WHERE (item_type = 'income' AND happen_at >= '2010-09-01' AND happen_at <= '2010-09-30')
---
  def amount
    @now_date = date_set( :date => params[:date] )

    @sum_type = "all"
    unless params[:sum_type].blank?
      @sum_type = params[:sum_type]
    else
      @sum_type = "month"
    end

    # 品目取得
    @items, @income, @expense = Item.find_items( :now_date => @now_date, :sum_type => @sum_type, :page => params[:page] )